{
  "posts": [
    {
      "slug": "retired-coble-boat",
      "title": "Retired (Coble Boat)",
      "date": "2025-10-19",
      "image": "/images/blog/blog-retired-coble-boat.jpg",
      "excerpt": "A new coloured pencil piece exploring the weathered beauty of a retired coble boat, capturing the textures and history in every plank.",
      "content": "I'm excited to share my latest coloured pencil work — \"Retired (Coble Boat).\" This piece was a labor of love, capturing the intricate textures of weathered wood and the quiet dignity of a boat that has seen many years on the water.\n\nThe details in the wood grain were particularly challenging and rewarding to render in coloured pencil. Each plank tells its own story of sun, salt, and time.\n\nI hope this piece speaks to you the way it spoke to me while I was creating it."
    },
    {
      "slug": "zebras-contd",
      "title": "Zebras cont'd...",
      "date": "2023-10-23",
      "image": "/images/blog/blog-zebras-contd.jpg",
      "excerpt": "Continuing work on my zebra piece — the stripes are coming together beautifully with layered coloured pencil technique.",
      "content": "Progress update on my zebra piece! The stripes are really starting to come alive now. Working with coloured pencils on this subject is both challenging and incredibly satisfying.\n\nEach stripe requires careful layering to achieve the right depth and contrast. I'm using a combination of dark indigo, black, and warm browns to create dimension in the dark stripes, while the light areas have subtle warm and cool tones.\n\nStay tuned for the finished piece!"
    },
    {
      "slug": "onward-and-upward",
      "title": "Onward and Upward...",
      "date": "2023-08-12",
      "image": "/images/blog/blog-onward-upward.png",
      "excerpt": "Reflecting on artistic growth and new directions in my creative journey.",
      "content": "Sometimes as artists we need to pause and reflect on where we've been and where we're headed. This post is about embracing new challenges and continuing to grow.\n\nI've been experimenting with new techniques and subjects, pushing myself out of my comfort zone. It's both terrifying and exhilarating.\n\nThe journey of an artist is never truly finished — there's always something new to learn, a new way to see the world."
    },
    {
      "slug": "let-there-be-lights-completed",
      "title": "Let There be Lights completed...",
      "date": "2023-08-12",
      "image": "/images/blog/blog-let-there-be-lights-completed.jpg",
      "excerpt": "The finished piece! \"Let There be Lights\" is complete after months of detailed coloured pencil work.",
      "content": "It's done! \"Let There be Lights\" is finally complete, and I couldn't be happier with how it turned out.\n\nThis piece has been a journey — from the initial sketch to the final burnished highlights, every step taught me something new about capturing light with coloured pencils.\n\nThe glow of the lights against the darker background was the biggest challenge, requiring many layers of careful color building. Thank you for following along on this journey!"
    },
    {
      "slug": "let-there-be-lights-contd",
      "title": "Let There be Lights cont'd...",
      "date": "2022-11-07",
      "image": "/images/blog/blog-let-there-be-lights-contd.jpg",
      "excerpt": "More progress on \"Let There be Lights\" — the details are really starting to come together.",
      "content": "Another update on \"Let There be Lights!\" The piece is really taking shape now. I've been focusing on the intricate details and the interplay of light and shadow.\n\nColoured pencil work at this level of detail requires incredible patience, but seeing it come together makes every hour worth it.\n\nI'm getting closer to the finish line with this one!"
    },
    {
      "slug": "let-there-be-lights-contd-2",
      "title": "\"Let There be Lights\"...cont'd",
      "date": "2022-10-14",
      "image": "/images/blog/blog-let-there-be-lights-contd-2.jpg",
      "excerpt": "Continuing to build layers and depth in \"Let There be Lights\" — capturing the warm glow of the lights.",
      "content": "Continuing to work on \"Let There be Lights\" — I'm at the stage where the layers are really starting to build up and create that luminous quality I'm after.\n\nThe key to capturing light with coloured pencils is working from dark to light, building up the surrounding darks so the light areas really pop.\n\nMore updates to come as I progress!"
    },
    {
      "slug": "let-there-be-lights",
      "title": "\"Let There be Lights!\"",
      "date": "2022-09-28",
      "image": "/images/blog/blog-let-there-be-lights.jpg",
      "excerpt": "Starting a new coloured pencil piece — \"Let There be Lights!\" Follow along as I bring this scene to life.",
      "content": "I'm starting an exciting new coloured pencil piece that I'm calling \"Let There be Lights!\" This one is going to be a real challenge, with complex lighting and intricate details.\n\nI've laid down the initial sketch and am beginning the first layers of color. The reference photo has such beautiful lighting that I knew I had to try to capture it.\n\nFollow along as I work through this piece — I'll be sharing progress updates along the way!"
    },
    {
      "slug": "55-chevrolet-contd",
      "title": "'55 Chevrolet cont'd...",
      "date": "2021-03-08",
      "image": "/images/blog/blog-55-chevy-contd.jpg",
      "excerpt": "Progress on the '55 Chevrolet — the chrome details are coming to life in coloured pencil.",
      "content": "More progress on my '55 Chevrolet piece! The chrome details are really starting to shine — literally. Capturing reflective surfaces in coloured pencil is one of my favorite challenges.\n\nThe key is observing all the subtle color variations in the reflections. What looks like \"silver\" is actually made up of blues, purples, greens, and warm tones all blended together.\n\nGetting closer to completion on this one!"
    },
    {
      "slug": "55-chevrolet",
      "title": "55' Chevrolet...",
      "date": "2021-02-03",
      "image": "/images/blog/blog-55-chevy.jpg",
      "excerpt": "Starting a new piece featuring a classic '55 Chevrolet — a perfect subject for coloured pencil detail work.",
      "content": "New project alert! I'm starting work on a classic '55 Chevrolet. The curves, chrome, and character of these vintage cars make them perfect subjects for detailed coloured pencil work.\n\nI've always been drawn to the design of classic cars — there's something about the craftsmanship and style of that era that speaks to the artist in me.\n\nThis is going to be a detailed piece — stay tuned for progress updates!"
    },
    {
      "slug": "out-to-pasture-completed",
      "title": "\"Out to Pasture\" completed...",
      "date": "2021-02-03",
      "image": "/images/blog/blog-out-to-pasture-completed.jpg",
      "excerpt": "\"Out to Pasture\" is complete — a tribute to the beauty of rural life and rustic charm.",
      "content": "\"Out to Pasture\" is finished! This piece was a wonderful journey into rural nostalgia — capturing the weathered textures and quiet beauty of a pastoral scene.\n\nEvery scratch and rust spot tells a story, and I tried to honor that history in the detail work. Coloured pencils allowed me to capture the subtle color variations that make these subjects so rich.\n\nI hope you enjoy viewing it as much as I enjoyed creating it!"
    },
    {
      "slug": "out-to-pasture-wip",
      "title": "Out to Pasture WIP...",
      "date": "2020-11-22",
      "image": "/images/blog/blog-out-to-pasture-wip.jpg",
      "excerpt": "Work in progress — \"Out to Pasture\" is taking shape with rich textures and earthy tones.",
      "content": "Work in progress update on \"Out to Pasture!\" I'm really enjoying this piece — the textures and earthy tones are right in my wheelhouse.\n\nI'm building up the layers slowly, working on capturing the weathered surfaces and the play of light across the scene. Coloured pencil is the perfect medium for this kind of detail work.\n\nMore to come!"
    },
    {
      "slug": "cabbage-soup-done",
      "title": "\"Cabbage Soup\" done...",
      "date": "2020-10-19",
      "image": "/images/blog/blog-cabbage-soup-done.jpg",
      "excerpt": "\"Cabbage Soup\" is complete — a detailed still life rendered in coloured pencil.",
      "content": "\"Cabbage Soup\" is done! This still life piece was a wonderful exercise in capturing the translucency and texture of vegetables in coloured pencil.\n\nThe subtle color variations in the cabbage leaves — from deep purple to bright green — made this a fascinating subject to work with. Each layer of pencil added more depth and realism.\n\nAnother piece I'm truly proud of!"
    },
    {
      "slug": "monochromatic-peony-simply-pure",
      "title": "Monochromatic Peony, \"Simply Pure\"",
      "date": "2020-04-16",
      "image": "/images/blog/blog-monochromatic-peony-pure.jpg",
      "excerpt": "The completed monochromatic peony — \"Simply Pure\" captures the delicate beauty of this flower in shades of white and gray.",
      "content": "\"Simply Pure\" is complete! This monochromatic peony has been a beautiful journey in exploring the subtleties of working with a limited palette.\n\nCapturing the soft, delicate petals of a white peony using only shades of gray and white required careful attention to the subtlest value changes. The result is something I find both peaceful and powerful.\n\nThis piece reminds me that sometimes less is more in art."
    },
    {
      "slug": "monochromatic-peony-day-4",
      "title": "Monochromatic Peony... (day 4)",
      "date": "2020-03-29",
      "image": "/images/blog/blog-monochromatic-peony-day4.jpg",
      "excerpt": "Day 4 of the monochromatic peony — the petals are gaining depth and dimension.",
      "content": "Day 4 on the monochromatic peony, and the petals are really starting to take shape! Working in monochrome forces you to focus entirely on value and form — there's nowhere to hide.\n\nI'm using a range of gray pencils from very light to quite dark, along with a white pencil for the brightest highlights. The layering process is meditative and rewarding.\n\nAlmost there!"
    },
    {
      "slug": "monochromatic-peony-start",
      "title": "Monochromatic Peony... (start)",
      "date": "2020-03-18",
      "image": "/images/blog/blog-monochromatic-peony-start.jpg",
      "excerpt": "Starting a new monochromatic peony in coloured pencil — exploring the beauty of limited palette.",
      "content": "Starting something different — a monochromatic peony! I've been wanting to explore working with a very limited palette, and a white peony seemed like the perfect subject.\n\nThe challenge here is capturing all the subtle tonal variations using only grays and whites. Every petal fold, every shadow needs to be rendered through value alone.\n\nI'm excited to see where this goes!"
    },
    {
      "slug": "peek-a-boo-finished",
      "title": "Peek a Boo is finished!",
      "date": "2020-03-16",
      "image": "/images/blog/blog-peek-a-boo-finished.jpg",
      "excerpt": "\"Peek a Boo\" is complete — a playful wildlife piece brought to life with coloured pencils.",
      "content": "\"Peek a Boo\" is finished! This playful piece has been so much fun to create. Capturing the curious expression and the textures of fur and foliage was a delightful challenge.\n\nI love how coloured pencils allow me to render the finest details — individual hairs, subtle color shifts in the eyes, the play of light through leaves.\n\nThis one definitely brought a smile to my face throughout the process!"
    },
    {
      "slug": "peek-a-boo-contd",
      "title": "Peek a Boo cont'd...",
      "date": "2020-03-13",
      "image": "/images/blog/blog-peek-a-boo-contd.jpg",
      "excerpt": "More progress on \"Peek a Boo\" — the character is really starting to emerge.",
      "content": "Progress update on \"Peek a Boo!\" The character is really emerging now. I've been working on building up the layers of fur and getting the expression just right.\n\nAnimal subjects are some of my favorites — there's something magical about capturing that spark of life and personality in their eyes.\n\nAlmost done — the finish line is in sight!"
    },
    {
      "slug": "peek-a-boo",
      "title": "Peek a Boo!...",
      "date": "2020-03-06",
      "image": "/images/blog/blog-peek-a-boo.jpg",
      "excerpt": "Starting a new wildlife piece — \"Peek a Boo!\" Follow along as this curious critter comes to life.",
      "content": "New piece alert! I'm starting a fun new wildlife piece I'm calling \"Peek a Boo!\" There's something irresistible about an animal peeking out from behind something — that curious, slightly mischievous look.\n\nI've got my reference ready and my pencils sharpened. This one is going to be full of personality!\n\nFollow along as I bring this little character to life!"
    },
    {
      "slug": "coloured-pencils-and-more",
      "title": "Coloured Pencils and more...",
      "date": "2020-02-08",
      "image": "/images/blog/blog-coloured-pencils-more.jpg",
      "excerpt": "Thoughts on my artistic journey and the mediums that inspire me — from coloured pencils to watercolour and beyond.",
      "content": "I wanted to take a moment to share some thoughts about my artistic journey and the mediums I work with.\n\nColoured pencils have been my primary love since junior high — there's something about the control and precision they offer that just clicks with me. But I've also been expanding into watercolour, acrylic, and oils, each offering its own unique challenges and rewards.\n\nWatercolour teaches you to embrace the unexpected. Acrylics and oils let you work with bold, rich colors and thick textures. But coloured pencils... they let you capture every tiny detail, every subtle shift in color and light.\n\nI'm grateful for all the mediums in my toolkit, and I'm excited to keep exploring and growing as an artist. Thank you for being part of this journey!"
    }
  ]
}
